/* Το παράδειγμα αυτό προέρχεται από το βιβλίο "C: Από τη θεωρία στην εφαρμογή"
των Γ. Σ. Τσελίκη και Ν. Δ. Τσελίκα, 2η έκδοση, σελίδα 252. */

#include <stdio.h>

void test(int a);

int main()
{

   void (*ptr)(int a);
   /* Η μεταβλητή ptr δηλώνεται ως δείκτης προς μια συνάρτηση,
   η οποία δέχεται μια ακέραια παράμετρο και δεν επιστρέφει τίποτα. */

   int i=10;

   ptr=test;
   /* Τώρα ο δείκτης ptr δείχνει στη διεύθυνση της συνάρτησης test.
   Όπως το όνομα ενός πίνακα μπορεί να χρησιμοποιηθεί σαν δείκτης, έτσι
   και το όνομα μιας συνάρτησης μπορεί να χρησιμοποιηθεί σαν δείκτης
   στη διεύθυνση της. */

   ptr(i);
   /* Η κλήση αυτή είναι ισοδύναμη με την (*ptr)(i); που τονίζει περισσότερο
   το γεγονός ότι ο ptr είναι δείκτης προς μία συνάρτηση. */

   return 0;
}

void test(int a)
{
   printf("Val = %d\n", 2*a);
}
